% price_buy=data.mpc.cost(1,:);
% price_sell=0.49*ones(1,24);
% plot(sum(data.P_wt*10000),'','LineWidth', 2,'Color',[0.47 0.67 0.19]);
% hold on;
% plot(sum(data.mpc.Pload*10000),'--','LineWidth', 2,'Color',[0 0.45 0.74]);
% heat_load=sum(double(model.heat_judge.pd'));
% plot(heat_load,'-.','LineWidth', 2,'Color',[1 0.41 0.16]);
% xlabel('时间/h','fontname','宋体','fontsize',13);
% h=legend('风力发电','电负荷','热负荷','Location','NorthEast','fontname','宋体','fontsize',10.5);
% ylabel('kW','fontname','宋体','fontsize',13);
%TOPSIS得分
% y=[0.412508283079616;0.417246112528380;0.422171299991549;0.427273882341070;0.432648439317039;0.438230423190676;0.444023095339594;0.450026474716786;0.456222641227726;0.462511145664206;0.468984637818453;0.475931267911384;0.482891374659889;0.489808701951752;0.496897682960704;0.504791637788058;0.512719797235225;0.520499889198857;0.528386077872984;0.536985926185808;0.545776541703796;0.554320346276245;0.562929364189017;0.572113114193032;0.581590463190521;0.590821634599066;0.600068558014087;0.609785827679309;0.619967177777784;0.629744415235632;0.639540389960117;0.649404775558554;0.659820490995098;0.670179441932504;0.680234887663004;0.689943734746340;0.698778250655473;0.707578320489995;0.716348471906857;0.725065261120080;0.733730574297108;0.742305498541800;0.750764818727811;0.759098361930193;0.767258118954705;0.775214448729948;0.782924136644462;0.790325679768040;0.797360349866495;0.803971702153400;0.808887856935666;0.811687382801690;0.813562947652653;0.814843139872702;0.815451332963894;0.815428882258074;0.814844661047875;0.813728644471104;0.812116413913699;0.810028607212752;0.807493011884870;0.804606092172368;0.801325269780784;0.797652711801290;0.791712555989096;0.784763280189386;0.777751402223889;0.770719482723199;0.763715185483220;0.756758757154324;0.749853700742831;0.742986664321271;0.736235300012420;0.729534911410053;0.722916768666012;0.716388770791359;0.709954842422092;0.703617598796650;0.697375023078670;0.691230278677130;0.685181502324935;0.679222679303797;0.673365854272314;0.667597111676178;0.661918548013516;0.656344387703557;0.650848834558830;0.645453518613060;0.640141292785950;0.634924230390830;0.629798755263598;0.624762423293560;0.619813823670913;0.614949828372421;0.610174275595887;0.605490184775737;0.600881471506865;0.596353158118194;0.591891437742742;0.587491716920384]';
% y = [price_buy;price_sell];
% y=[-21.4253654568209;-22.0637390271421;-22.8077139442511;-23.6057137820795;-24.1424769627162;-24.2907862768328;-24.3484363869312;-24.0261977855308;-22.5526833740007;-20.2619478393783;-18.3122686407888;-17.1248267734239;-16.3102627625344;-15.7665140117766;-15.8084780023077;-16.2667168539222;-17.2089795131972;-18.3077407090618;-19.0782452145328;-19.5754012028856;-20.1131456103439;-20.4084826344518;-20.3181278127121;-20.1185931977269]';
% close all;
%%
h_fig = figure();          % gcf: get current figure
h_axis = gca;              % gca: get current axis

%% set position & color
% position, color,
left = 10; bottom = 10; width = 10; height = 6;
% units:inches|centimeters|normalized|points|{pixels}|characters
set(h_fig, 'Units','centimeters', 'position', [left, bottom, width, height], 'color', 'w');

%% Remove the blank edge
set(gca,'LooseInset',get(gca,'TightInset'));

%% Setting color
cmap = brewermap(8,'Set3');
h_fig.Colormap = cmap;
h_axis.Colormap = cmap;
colororder(cmap)

%% plot购售电价格
% x1=datenum('00:00');
% x2=datenum('24:00');
% x=linspace(x1,x2,24);
% stairs(x,y(1,:));
% datetick('x',15);
% hold on;
% stairs(x,y(2,:));
% datetick('x',15);
% grid on;

%% 室外温度
% x1=datenum('00:00');
% x2=datenum('24:00');
% x=linspace(x1,x2,24);
% stairs(x,y);
% datetick('x',15);
% grid on;

%% 绘制风电和电负荷曲线
% x1=datenum('00:00');
% x2=datenum('24:00');
% x=linspace(x1,x2,24);
% plot(x,sum(data.P_wt*10000),'-o');
% hold on;
% plot(x,sum(data.mpc.Pload*10000),'-*');
% datetick('x',15);
% ylim([750 6500])
% grid on;

%% 绘制Pareto前沿
% subplot(1,2,1);
% plot(D(:,2),D(:,1),'','LineWidth', 2,'Color',[0.47 0.67 0.19]);
% hold on;
% plot(D1(:,2),D1(:,1),'--','LineWidth', 2,'Color',[0 0.45 0.74]);
% hold on;
% grid;plot(D2(:,2),D2(:,1),'-.','LineWidth', 2,'Color',[1 0.41 0.16]);
% xlim([135000 143000])
% ylim([182000 189000])
% h=legend('Scenario 1','Scenario 2','Scenario 3','Interpreter','latex','Location','NorthEast','fontname','Times New Roman','fontsize',12);
% set (h,'box','off');
% set(gca,'FontName','Times New Roman','FontSize',12);
% ylabel('$ \rm{Operating\ cost/RMB}$','Interpreter','latex','fontname','Times New Roman','fontsize',13);
% xlabel('$ \rm{kgCO_2}$','Interpreter','latex','fontname','Times New Roman','fontsize',13);
% axes('Position',[0.4,0.4,0.4,0.4]);
% plot(D(:,2),D(:,1),'','LineWidth', 2,'Color',[0.47 0.67 0.19]);
% hold on;
% plot(D1(:,2),D1(:,1),'--','LineWidth', 2,'Color',[0 0.45 0.74]);
% hold on;
% grid;plot(D2(:,2),D2(:,1),'-.','LineWidth', 2,'Color',[1 0.41 0.16]);
% set(gca,'FontName','Times New Roman','FontSize',11);
% 
% 
% %% 绘制得分曲线，3条
% subplot(1,2,2);
% x=1:20;
% %初始
% s1=[0.648563525000000;0.670494418000000;0.683301795000000;0.687912684000000;0.686628936000000;0.680523479000000;0.668833040000000;0.651364037000000;0.628539037000000;0.601416060000000;0.571463746000000;0.540173035000000;0.508780860000000;0.478498793000000;0.450102408000000;0.424515498000000;0.401287364000000;0.381168692000000;0.364708811000000;0.351436475000000];
% %不考虑负荷热惯性
% s2=[0.645771005000000;0.668314766000000;0.682904271000000;0.689473103000000;0.689164466000000;0.683950764000000;0.673212868000000;0.656522036000000;0.634191042000000;0.607119046000000;0.577020581000000;0.545512955000000;0.513816456000000;0.483293493000000;0.454549224000000;0.428655403000000;0.404824252000000;0.384278584000000;0.367629424000000;0.354228995000000];
% %扩大蓄电池容量
% s3=[0.659576769000000;0.681340692000000;0.692146509000000;0.693483273000000;0.690644495000000;0.682747380000000;0.669154207000000;0.649761187000000;0.625169252000000;0.596556458000000;0.565386914000000;0.533112592000000;0.500932406000000;0.469944427000000;0.440729014000000;0.414539260000000;0.390335513000000;0.369782290000000;0.353370304000000;0.340423231000000];
% plot(x,s1,'','LineWidth', 2,'Color',[0.47 0.67 0.19]);
% hold on;
% plot(x,s2,'--','LineWidth', 2,'Color',[0 0.45 0.74]);
% hold on;
% grid;plot(x,s3,'-.','LineWidth', 2,'Color',[1 0.41 0.16]);
% xlim([0 20])
% ylim([0.3 0.73])
% set(gca,'FontName','Times New Roman','FontSize',12);
% xlabel('$ \rm{No.\ of\ Pareto\ optimal\ point}$','Interpreter','latex','fontname','Times New Roman','fontsize',13);
% ylabel('$ \rm{Score}$','Interpreter','latex','fontname','Times New Roman','fontsize',13);
% axes('Position',[0.4,0.4,0.4,0.4]);
% plot(x,s1,'','LineWidth', 2,'Color',[0.47 0.67 0.19]);
% hold on;
% plot(x,s2,'--','LineWidth', 2,'Color',[0 0.45 0.74]);
% hold on;
% grid;
% plot(x,s3,'-.','LineWidth', 2,'Color',[1 0.41 0.16]);
% set(gca,'FontName','Times New Roman','FontSize',11);
% h=legend('Scenario 1','Scenario 2','Scenario 3','Interpreter','latex','Location','NorthEast','fontname','Times New Roman','fontsize',12);
% set (h,'box','off');
%% 绘制减排成本曲线，3条
% %原始
% x=2:19;
% c1=-1*[-3.81237708900000;-1.44179460800000;-0.968075854000000;-0.855029692000000;-0.820341511000000;-0.790123278000000;-0.761801523000000;-0.734235469000000;-0.708324024000000;-0.683164262000000;-0.654898705000000;-0.622748773000000;-0.585198869000000;-0.544021862000000;-0.488362495000000;-0.421917684000000;-0.361219850000000;-0.295337959000000];
% % %不考虑负荷热惯性
% c2=-1*[-4.48870461100000;-1.64170594000000;-1.02983757500000;-0.866446640000000;-0.828038261000000;-0.796851211000000;-0.764646422000000;-0.731193359000000;-0.701036513000000;-0.675820578000000;-0.647842455000000;-0.616837836000000;-0.579591751000000;-0.538246891000000;-0.479579892000000;-0.411955964000000;-0.356270639000000;-0.294485251000000];
% % %扩大蓄电池容量
% c3=-1*[-3.27743589600000;-1.17219473800000;-0.844600155000000;-0.808837690000000;-0.781165366000000;-0.755250574000000;-0.729948010000000;-0.706225116000000;-0.684284219000000;-0.662784379000000;-0.638302254000000;-0.609047883000000;-0.571081901000000;-0.531020462000000;-0.472202747000000;-0.405879618000000;-0.353143344000000;-0.291521708000000];
% plot(x,c1,'','LineWidth', 2,'Color',[0.47 0.67 0.19]);
% hold on;
% plot(x,c2,'--','LineWidth', 2,'Color',[0 0.45 0.74]);
% hold on;
% grid;plot(x,c3,'-.','LineWidth', 2,'Color',[1 0.41 0.16]);
% xlim([1 20])
% % % ylim([144000 152300])
% h=legend('Scenario 1','Scenario 2','Scenario 3','Interpreter','latex','Location','NorthEast','fontname','Times New Roman','fontsize',10.5);
% % set(h,'Interpreter','latex');
% set (h,'box','off');
% set(gca,'FontName','Times New Roman','FontSize',10.5);
% xlabel('$ \rm{No.\ of\ Pareto\ optimal\ point}$','Interpreter','latex','fontname','Times New Roman','fontsize',12);
% ylabel('$\rm RMB/kgCO_2$','Interpreter','latex','fontname','Times New Roman','fontsize',12);
% axes('Position',[0.4,0.4,0.4,0.4]);
% plot(x,c1,'','LineWidth', 2,'Color',[0.47 0.67 0.19]);
% hold on;
% plot(x,c2,'--','LineWidth', 2,'Color',[0 0.45 0.74]);
% hold on;
% grid;plot(x,c3,'-.','LineWidth', 2,'Color',[1 0.41 0.16]);
% set(gca,'FontName','Times New Roman','FontSize',10.5);
% hold off;
%% 绘制场景1下CHP机组的局部碳减排敏感度和局部碳减排成本
%由于第一个运行点，CHP碳排放较少，所以碳减排空间不大,5：19
% x1=5:19;
% CLCER_CHP=[0.0131172350000000;0.0130116820000000;0.00914212500000000;0.00726908500000000;0.00554645100000000;0.00624448900000000;0.00665047400000000;0.0127572750000000;0.0292784210000000;0.0299413570000000;0.0197126660000000;0.0238118010000000;0.0730776880000000;0.0761726110000000;0.0989836330000000];
% plot(x1,CLCER_CHP,'.-','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.35 0.49 0.16]);
% hold on;
% x2=1:19;
% SLCER_CHP=[0.0584802660000000;0.0538170490000000;0.108594817000000;0.0891001900000000;0.0131425650000000;0.0133239150000000;0.0100952900000000;0.00854900400000000;0.00696908600000000;0.00807544200000000;0.00881810000000000;0.0165312240000000;0.0345942860000000;0.0331320390000000;0.0268549900000000;0.0320868500000000;0.0765809820000000;0.0810999720000000;0.0998033500000000];
% plot(x2,SLCER_CHP,'--.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0 0.45 0.74]);
% hold on;
% x3=2:20;
% CLCER_GB=[0.379983288000000;0.242152566000000;0.0174615410000000;0.00843007100000000;0.00704595900000000;0.00328644500000000;0.00405637900000000;0.00466591900000000;0.00482367600000000;0.00464563700000000;0.0297374440000000;0.0252802800000000;0.0167738100000000;0.0137021010000000;0.0966103710000000;0.115442849000000;0.106326734000000;0.253732592000000;0.260947020000000];
% plot(x3,CLCER_GB,'-..','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.49 0.18 0.56]);
% hold on;
% x4=4:15;
% SLCER_GB=[0.0236871700000000;0.0108979360000000;0.00929511000000000;0.00442489000000000;0.00560469900000000;0.00680566000000000;0.00730312000000000;0.00743372900000000;0.0758747000000000;0.0620115470000000;0.0400286100000000;0.0350020340000000];
% grid;
% plot(x4,SLCER_GB,':.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.85 0.33 0.1]);
% h=legend({'$\rm CLCER_{CHP}\ (RMB/kgCO_2)$','$\rm SLCER_{CHP}$','$\rm CLCER_{GB}\ (RMB/kgCO_2)$','$\rm SLCER_{GB}$'},'Location','NorthEast','fontname','Times New Roman','fontsize',11);
% set(h,'Interpreter','latex');
% set (h,'box','off');
% set(gca,'FontName','Times New Roman','FontSize',11);
% xlabel('$ \rm{No.\ of\ Pareto\ optimal\ point}$','Interpreter','latex','fontname','Times New Roman','fontsize',13);
% ylim([-0.02 0.45]);
% xlim([0.5 20.5]);
% hold on;
% axes('Position',[0.4,0.4,0.4,0.4]);
% plot(x1,CLCER_CHP,'.-','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.35 0.49 0.16]);
% hold on;
% plot(x2,SLCER_CHP,'--.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0 0.45 0.74]);
% hold on;
% plot(x3,CLCER_GB,'-..','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.49 0.18 0.56]);
% hold on;
% grid;plot(x4,SLCER_GB,':.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.85 0.33 0.1]);
% set(gca,'FontName','Times New Roman','FontSize',10.5);
% hold off;
%% 绘制场景2下CHP机组的局部碳减排敏感度和局部碳减排成本
% x1=5:19;
% CLCER_CHP=[0.0130397300000000;0.0132165160000000;0.0134919130000000;0.0108157610000000;0.00756861200000000;0.00656473100000000;0.00704047100000000;0.0151693220000000;0.0284900030000000;0.0266147060000000;0.0187693400000000;0.0440529530000000;0.0723765550000000;0.0727751750000000;0.0994108430000000];
% plot(x1,CLCER_CHP,'.-','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.35 0.49 0.16]);
% hold on;
% x2=1:19;
% SLCER_CHP=[0.0115664990000000;0.0455350050000000;0.108323540000000;0.109406209000000;0.0130325760000000;0.0134305020000000;0.0141606330000000;0.0120057590000000;0.00937398700000000;0.00859131300000000;0.00941191800000000;0.0195331900000000;0.0335171590000000;0.0304444100000000;0.0258951040000000;0.0480694960000000;0.0765059390000000;0.0788677110000000;0.100182444000000];
% plot(x2,SLCER_CHP,'--.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0 0.45 0.74]);
% hold on;
% x3=2:20;
% CLCER_GB=[0.418502650000000;0.247854619000000;0.0215083500000000;0.00833585700000000;0.00800332900000000;0.00646008900000000;0.00539859300000000;0.00658542300000000;0.00572679100000000;0.00917483200000000;0.0302083660000000;0.0211183870000000;0.0161091670000000;0.0145034280000000;0.104390004000000;0.122342610000000;0.126456280000000;0.253341598000000;0.261260421000000];
% plot(x3,CLCER_GB,'-..','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.49 0.18 0.56]);
% hold on;
% x4=4:15;
% SLCER_GB=[0.0677712260000000;0.0106919300000000;0.0105366680000000;0.00869383100000000;0.00749707500000000;0.00981423900000000;0.00886812300000000;0.0168958990000000;0.0784960740000000;0.0506212960000000;0.0377156670000000;0.0361854580000000];
% grid;
% plot(x4,SLCER_GB,':.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.85 0.33 0.1]);
% h=legend({'$\rm CLCER_{CHP}\ (RMB/kgCO_2)$','$\rm SLCER_{CHP}$','$\rm CLCER_{GB}\ (RMB/kgCO_2)$','$\rm SLCER_{GB}$'},'Location','NorthEast','fontname','Times New Roman','fontsize',11);
% set(h,'Interpreter','latex');
% set (h,'box','off');
% set(gca,'FontName','Times New Roman','FontSize',11);
% xlabel('$ \rm{No.\ of\ Pareto\ optimal\ point}$','Interpreter','latex','fontname','Times New Roman','fontsize',13);
% ylim([-0.02 0.45]);
% xlim([0.5 20.5]);
% hold on;
% axes('Position',[0.4,0.4,0.4,0.4]);
% plot(x1,CLCER_CHP,'.-','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.35 0.49 0.16]);
% hold on;
% plot(x2,SLCER_CHP,'--.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0 0.45 0.74]);
% hold on;
% plot(x3,CLCER_GB,'-..','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.49 0.18 0.56]);
% hold on;
% grid;plot(x4,SLCER_GB,':.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.85 0.33 0.1]);
% set(gca,'FontName','Times New Roman','FontSize',10.5);
% hold off;
%% 绘制场景3下CHP机组的局部碳减排敏感度和局部碳减排成本
%由于第一个运行点，CHP碳排放较少，所以碳减排空间不大,2：25
% x1=4:19;
% CLCER_CHP=[0.0291769410000000;0.0244491720000000;0.0143261910000000;0.00931429300000000;0.00957774100000000;0.00991056300000000;0.00848066900000000;0.00913938000000000;0.0116367350000000;0.0230036930000000;0.0243167730000000;0.0239451850000000;0.0475597500000000;0.0631885310000000;0.0686284240000000;0.0989324640000000];
% plot(x1,CLCER_CHP,'.-','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.35 0.49 0.16]);
% hold on;
% x2=1:19;
% SLCER_CHP=[0.0106769640000000;0.0394473470000000;0.0786464700000000;0.0271515060000000;0.0241973080000000;0.0154919620000000;0.0108782990000000;0.0117287700000000;0.0124016950000000;0.0109474860000000;0.0120779420000000;0.0152515350000000;0.0286310470000000;0.0314273290000000;0.0303247050000000;0.0558530590000000;0.0748172410000000;0.0794654610000000;0.101542005000000];
% plot(x2,SLCER_CHP,'--.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0 0.45 0.74]);
% hold on;
% x3=2:20;
% CLCER_GB=[0.120044480000000;0.0443860760000000;0.0153649130000000;0.0147645330000000;0.0158346410000000;0.0190777760000000;0.0155732890000000;0.0120325390000000;0.0101650450000000;0.00998811700000000;0.0335246280000000;0.0221871830000000;0.0174719570000000;0.0137949940000000;0.119050646000000;0.138049222000000;0.143925423000000;0.253481801000000;0.260811852000000];
% plot(x3,CLCER_GB,'-..','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.49 0.18 0.56]);
% hold on;
% x4=[1,3:15];
% SLCER_GB=[0.0268517060000000;0.0990533510000000;0.0207068450000000;0.0209103830000000;0.0236771480000000;0.0300036750000000;0.0250812730000000;0.0194970670000000;0.0168109230000000;0.0171098580000000;0.106490572000000;0.0605070920000000;0.0432811840000000;0.0343093460000000];
% grid;
% plot(x4,SLCER_GB,':.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.85 0.33 0.1]);
% h=legend({'$\rm CLCER_{CHP}\ (RMB/kgCO_2)$','$\rm SLCER_{CHP}$','$\rm CLCER_{GB}\ (RMB/kgCO_2)$','$\rm SLCER_{GB}$'},'Location','NorthEast','fontname','Times New Roman','fontsize',11);
% set(h,'Interpreter','latex');
% set (h,'box','off');
% set(gca,'FontName','Times New Roman','FontSize',11);
% xlabel('$ \rm{No.\ of\ Pareto\ optimal\ point}$','Interpreter','latex','fontname','Times New Roman','fontsize',13);
% ylim([-0.02 0.3]);
% xlim([0.5 20.5]);
% hold on;
% axes('Position',[0.4,0.4,0.4,0.4]);
% plot(x1,CLCER_CHP,'.-','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.35 0.49 0.16]);
% hold on;
% plot(x2,SLCER_CHP,'--.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0 0.45 0.74]);
% hold on;
% plot(x3,CLCER_GB,'-..','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.49 0.18 0.56]);
% hold on;
% grid;plot(x4,SLCER_GB,':.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.85 0.33 0.1]);
% set(gca,'FontName','Times New Roman','FontSize',10.5);
% hold off;

%% 场景1、2的碳减排敏感度对比
subplot(1,2,1);
x1=5:19;
CLCER_CHP_s1=[0.0131172350000000;0.0130116820000000;0.00914212500000000;0.00726908500000000;0.00554645100000000;0.00624448900000000;0.00665047400000000;0.0127572750000000;0.0292784210000000;0.0299413570000000;0.0197126660000000;0.0238118010000000;0.0730776880000000;0.0761726110000000;0.0989836330000000];
plot(x1,CLCER_CHP_s1,'.-','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.35 0.49 0.16]);
hold on;
x2=1:19;
SLCER_CHP_s1=[0.0584802660000000;0.0538170490000000;0.108594817000000;0.0891001900000000;0.0131425650000000;0.0133239150000000;0.0100952900000000;0.00854900400000000;0.00696908600000000;0.00807544200000000;0.00881810000000000;0.0165312240000000;0.0345942860000000;0.0331320390000000;0.0268549900000000;0.0320868500000000;0.0765809820000000;0.0810999720000000;0.0998033500000000];
plot(x2,SLCER_CHP_s1,'--.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0 0.45 0.74]);
hold on;
x1=4:19;
CLCER_CHP_s3=[0.0291769410000000;0.0244491720000000;0.0143261910000000;0.00931429300000000;0.00957774100000000;0.00991056300000000;0.00848066900000000;0.00913938000000000;0.0116367350000000;0.0230036930000000;0.0243167730000000;0.0239451850000000;0.0475597500000000;0.0631885310000000;0.0686284240000000;0.0989324640000000];
plot(x1,CLCER_CHP_s3,'-..','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.85 0.33 0.1]);
hold on;
x2=1:19;
SLCER_CHP_s3=[0.0106769640000000;0.0394473470000000;0.0786464700000000;0.0271515060000000;0.0241973080000000;0.0154919620000000;0.0108782990000000;0.0117287700000000;0.0124016950000000;0.0109474860000000;0.0120779420000000;0.0152515350000000;0.0286310470000000;0.0314273290000000;0.0303247050000000;0.0558530590000000;0.0748172410000000;0.0794654610000000;0.101542005000000];
grid;plot(x2,SLCER_CHP_s3,':.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.49 0.18 0.56]);
hold on;
h=legend({'$\rm CLCER_{CHP}^{s1}\ (RMB/kgCO_2)$','$\rm SLCER_{CHP}^{s1}$','$\rm CLCER_{CHP}^{s3}\ (RMB/kgCO_2)$','$\rm SLCER_{CHP}^{s3}$'},'Location','NorthEast','fontname','Times New Roman','fontsize',11);
set(h,'Interpreter','latex');
set (h,'box','off');
set(gca,'FontName','Times New Roman','FontSize',11);
xlabel('$ \rm{No.\ of\ Pareto\ optimal\ point}$','Interpreter','latex','fontname','Times New Roman','fontsize',13);
ylim([-0.01 0.12]);
xlim([0.5 20.5]);
% axes('Position',[0.4,0.4,0.4,0.4]);
% plot(x1,CLCER_CHP_s1,'.-','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.35 0.49 0.16]);
% hold on;
% plot(x2,SLCER_CHP_s1,'--.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0 0.45 0.74]);
% plot(x1,CLCER_CHP_s2,'-..','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.85 0.33 0.1]);
% hold on;
% grid;
% plot(x2,SLCER_CHP_s2,':.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.49 0.18 0.56]);
% set(gca,'FontName','Times New Roman','FontSize',10);
% hold off;
subplot(1,2,2);
x3=2:20;
CLCER_GB_s1=[0.379983288000000;0.242152566000000;0.0174615410000000;0.00843007100000000;0.00704595900000000;0.00328644500000000;0.00405637900000000;0.00466591900000000;0.00482367600000000;0.00464563700000000;0.0297374440000000;0.0252802800000000;0.0167738100000000;0.0137021010000000;0.0966103710000000;0.115442849000000;0.106326734000000;0.253732592000000;0.260947020000000];
plot(x3,CLCER_GB_s1,'.-','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.35 0.49 0.16]);
hold on;
x4=4:15;
SLCER_GB_s1=[0.0236871700000000;0.0108979360000000;0.00929511000000000;0.00442489000000000;0.00560469900000000;0.00680566000000000;0.00730312000000000;0.00743372900000000;0.0758747000000000;0.0620115470000000;0.0400286100000000;0.0350020340000000];
plot(x4,SLCER_GB_s1,'--.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0 0.45 0.74]);
x3=2:20;
CLCER_GB_s3=[0.120044480000000;0.0443860760000000;0.0153649130000000;0.0147645330000000;0.0158346410000000;0.0190777760000000;0.0155732890000000;0.0120325390000000;0.0101650450000000;0.00998811700000000;0.0335246280000000;0.0221871830000000;0.0174719570000000;0.0137949940000000;0.119050646000000;0.138049222000000;0.143925423000000;0.253481801000000;0.260811852000000];
plot(x3,CLCER_GB_s3,'-..','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.85 0.33 0.1]);
hold on;
x44=[1,3:15];
SLCER_GB_s3=[0.0268517060000000;0.0990533510000000;0.0207068450000000;0.0209103830000000;0.0236771480000000;0.0300036750000000;0.0250812730000000;0.0194970670000000;0.0168109230000000;0.0171098580000000;0.106490572000000;0.0605070920000000;0.0432811840000000;0.0343093460000000];
grid;
plot(x44,SLCER_GB_s3,':.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.49 0.18 0.56]);
h=legend({'$\rm CLCER_{GB}^{s1}\ (RMB/kgCO_2)$','$\rm SLCER_{GB}^{s1}$','$\rm CLCER_{GB}^{s3}\ (RMB/kgCO_2)$','$\rm SLCER_{GB}^{s3}$'}...
    ,'Location','NorthEast','fontname','Times New Roman','fontsize',11);
set(h,'Interpreter','latex');
set (h,'box','off');
set(gca,'FontName','Times New Roman','FontSize',11);
xlabel('$ \rm{No.\ of\ Pareto\ optimal\ point}$','Interpreter','latex','fontname','Times New Roman','fontsize',13);
ylim([-0.02 0.45]);
xlim([0.5 20.5]);
axes('Position',[0.4,0.4,0.4,0.4]);
plot(x3,CLCER_GB_s1,'.-','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.35 0.49 0.16]);
hold on;
plot(x4,SLCER_GB_s1,'--.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0 0.45 0.74]);
plot(x3,CLCER_GB_s3,'-..','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.85 0.33 0.1]);
hold on;
grid;
plot(x44,SLCER_GB_s3,':.','LineWidth', 1.5,'MarkerSize', 11,'Color',[0.49 0.18 0.56]);
set(gca,'FontName','Times New Roman','FontSize',10);
%% 绘制电热平衡调度结果
% subplot(1,2,1);
% Pbuy=10000*model.judge.Pbuy;
% Psell=10000*model.judge.Psell;
% Pdischarge=10000*sum(model.judge.P_BT_discharge);
% Pcharge=10000*sum(model.judge.P_BT_charge);
% Pwt=10000*sum(model.p_wt);
% Pchp=10000*model.judge.P_CHP;
% 
% x1=datenum('00:00');
% x2=datenum('24:00');
% x=linspace(x1,x2,24);
% datetick('x',15);
% PP=[Pbuy+Psell;Pdischarge-Pcharge;Pwt;Pchp];
% % x1=datenum('00:00');
% % x2=datenum('24:00');
% % x=linspace(x1,x2,24);
% % datetick('x',15);
% b=bar(x,(PP)',0.5,'stack');
% set(b(1),'FaceColor',[.7 .58 .55]);%grid
% set(b(2),'FaceColor',[.33 .56 .72]);%bt
% set(b(3),'FaceColor',[.41 .58 .41]);%wt
% set(b(4),'FaceColor',[.44 .7 .74]);%CHP
% set(b,'edgecolor','none');
% h=legend('$ \rm{Grid}$','$ \rm{BT}$','$ \rm{WT}$','$ \rm{CHP}$','Interpreter','latex',...
%     'Location','NorthWest','fontname','Times New Roman','fontsize',9);
% h.NumColumns=3;
% set(h,'Orientation','horizon');
% set (h,'box','off');
% hold on
% x1=datenum('00:00');
% x2=datenum('24:00');
% x=linspace(x1,x2,24);
% dateaxis('x',15);
% grid;plot(x,(data.Eload)*10000,'r','linewidth',1);
% ylabel('kW','fontname','Times New Roman','fontsize',11);
% set(gca,'FontName','Times New Roman','FontSize',10.5);
% ylim([-1000 8000]);
% hold off
% 
% subplot(1,2,2);
% heat_load=sum(double(model.heat_judge.pd'));
% x1=datenum('00:00');
% x2=datenum('24:00');
% x=linspace(x1,x2,24);
% datetick('x',15);
% PP=[model.judge.H_HS_out-model.judge.H_HS_in;model.judge.H_CHP;model.judge.H_GB];
% b=bar(x,PP',0.5,'stack');
% set(b(1),'FaceColor',[.7 .58 .55]);%grid
% set(b(2),'FaceColor',[.44 .7 .74]);%CHP
% set(b(3),'FaceColor',[.41 .58 .41]);%wt
% 
% set(b,'edgecolor','none');
% h=legend('$ \rm{TST}$','$ \rm{CHP}$','$ \rm{GB}$','Interpreter','latex',...
%     'Location','NorthWest','fontname','Times New Roman','fontsize',9);
% h.NumColumns=3;
% set(h,'Orientation','horizon');
% set (h,'box','off');
% hold on
% x1=datenum('00:00');
% x2=datenum('24:00');
% x=linspace(x1,x2,24);
% dateaxis('x',15);
% grid;plot(x,heat_load,'r','linewidth',1);
% ylabel('kW','fontname','Times New Roman','fontsize',11);
% set(gca,'FontName','Times New Roman','FontSize',10.5);
% ylim([-2000 14000]);
% hold off

%% Axis & Ticks & TickLabel & xlabel
% axis([x(1) x(end) floor(min(y(:)-0.5)) ceil(max(y(:)+0.5))]);%画底线
% set(h_axis, 'XTick', [1:length(x)/5:length(x)]);                        % or xticks();
% set(h_axis, 'YTick', [floor(min(y(:)-0.5)): 0.5: ceil(max(y(:)+0.5))]); % or yticks();
% set(h_axis, 'XTickLabel', [1:6]);                                       % or xticklabels();
% set(h_axis, 'YTickLabel', [1:6]); yticklabels([1 2 3 4 5]);             % or yticklabels();

%% Y log
% set(h_axis,'yscale','log');

%% Title & Label
% title('Example');
% xlabel('Operating point number');
% ylabel('TOPSIS score');
% ylabel('¥/kgCO2');
% ylabel('¥/kWh');
% ylabel('℃');
% legend({'Wind power', 'Electrical load'}, ...
%     'Orientation', 'Horizontal', ...
%     'NumColumns',2, ...
%     'Location', 'Northwest', ...
% %     'FontSize',8,'FontName','Times New Roman');
% legend boxoff;
